ERM/src/Documents/BillingCalculation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>BillingCalculation</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Billing</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CreatedBy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModifiedBy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModificationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LawsonBilling</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Company</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LegalEntity</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LegalEntiites</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AU</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>USDAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>HOBBilling</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Company</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LegalEntity</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LegalEntiites</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AU</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>InitialAR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FinalAR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Collection</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>USDAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/Enums/BillingCalculationMethods/BillingCalculationMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>BillingCalculationMethods</name>
  <enumValues>
    <name>Revenue</name>
  </enumValues>
  <enumValues>
    <name>Ignore</name>
  </enumValues>
  <enumValues>
    <name>DocumentBillingCalculation</name>
  </enumValues>
</mdclass:Enum>

ERM/src/Enums/ТипыСоответствий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыСоответствий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Lawson</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OracleSmith</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OracleMI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HOBs</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьCRM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьParentClients</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sun</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ERM/src/Documents/BillingCalculation/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаполнитьДанныеПоБиллингу(СтруктураПараметров, АдресХранилища) Экспорт
	
	ОбщаяТаблицаБиллинга = Перечисления.BillingCalculationMethods.ПолучитьБиллинг(НачалоМесяца(СтруктураПараметров.Дата)
		, КонецМесяца(СтруктураПараметров.Дата));
	
	ДанныеПоБиллингу = НовыеДанныеПоБиллингу();
	
	Для Каждого СтрокаТаблицыБиллинга Из ОбщаяТаблицаБиллинга Цикл
		
		Метод = rgsКонсолидацияДанныхСерверПовтИсп.ОпределитьМетодРасчетаБиллинга(КонецМесяца(СтруктураПараметров.Дата)
			, СтрокаТаблицыБиллинга.Source, СтрокаТаблицыБиллинга.GeoMarket, СтрокаТаблицыБиллинга.Segment
			, СтрокаТаблицыБиллинга.SubSegment, СтрокаТаблицыБиллинга.SubSubSegment, СтрокаТаблицыБиллинга.HFMCompany);
			
		Если СтрокаТаблицыБиллинга.Method = Метод ИЛИ Метод = Перечисления.BillingCalculationMethods.Ignore Тогда
			
			Если Метод = Перечисления.BillingCalculationMethods.Ignore Тогда
				СтрокаТаблицыБиллинга.Method = Перечисления.BillingCalculationMethods.Ignore;
			КонецЕсли;
			
			Если СтрокаТаблицыБиллинга.Source = Перечисления.ТипыСоответствий.Lawson Тогда
				ЗаполнитьЗначенияСвойств(ДанныеПоБиллингу.LawsonBilling.Добавить(), СтрокаТаблицыБиллинга);
			ИначеЕсли СтрокаТаблицыБиллинга.Source = Перечисления.ТипыСоответствий.HOBs Тогда
				ЗаполнитьЗначенияСвойств(ДанныеПоБиллингу.HOBBilling.Добавить(), СтрокаТаблицыБиллинга);
			ИначеЕсли СтрокаТаблицыБиллинга.Source = Перечисления.ТипыСоответствий.OracleMI Тогда
				ЗаполнитьЗначенияСвойств(ДанныеПоБиллингу.OracleMIBilling.Добавить(), СтрокаТаблицыБиллинга);
			ИначеЕсли СтрокаТаблицыБиллинга.Source = Перечисления.ТипыСоответствий.OracleSmith Тогда
				ЗаполнитьЗначенияСвойств(ДанныеПоБиллингу.OracleSmithBilling.Добавить(), СтрокаТаблицыБиллинга);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеДляЗаполнения = Новый Структура();
	ДанныеДляЗаполнения.Вставить("ДанныеПоБиллингу", ДанныеПоБиллингу);
	
	ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);
	
КонецПроцедуры

Функция НовыеДанныеПоБиллингу()
	
	Результат = Новый Структура();
	
	Документ = Документы.BillingCalculation.СоздатьДокумент();
	Результат.Вставить("LawsonBilling", Документ.LawsonBilling.ВыгрузитьКолонки());
	Результат.Вставить("HOBBilling", Документ.HOBBilling.ВыгрузитьКолонки());
	Результат.Вставить("OracleMIBilling", Документ.OracleMIBilling.ВыгрузитьКолонки());
	Результат.Вставить("OracleSmithBilling", Документ.OracleSmithBilling.ВыгрузитьКолонки());
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
